app/Controllers/Prestamo.php

            $newName = $logo->getRandomName();
            $uploadPath = './public/Productos';
            $logo->move($uploadPath, $newName);
            $prestamoModel->update($id, ['pres_evidencia' => base_url($uploadPath . "/" . $newName)]);
---
UPDATE `prestamo` SET `pres_inve_id` = '3', `pres_usua_id` = '5', `pres_cantidad` = '1', `pres_codigouni_alumno` = '0', `pres_fechasolicitud` = '2024-06-05 00:00:00', `pres_fechaentregado` = '2024-06-05 00:00:00', `pres_fechadevolucion` = '2024-06-05 00:00:00', `pres_fecharealdevolucion` = '2024-06-05 00:00:00', `pres_observacion` = 'xd', `pres_estado` = 'xd', `pres_evidencia` = NULL
WHERE `prestamo`.`pres_id` IN ('6')

    public function update($id) {
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new UsuarioModel();
        $registro = $model->where('usua_estado', 1)->findAll();
---
SELECT *
FROM `usuario`
WHERE `usua_estado` = 1