app/Models/PrestamoModel.php

    public function getPrestamo(){
        return $this->db->table('prestamo p')
        ->join('inventario i', 'i.inve_id = p.pres_inve_id')
        ->join('usuario u', 'u.usua_id = p.pres_usua_id')
        ->join('producto pr', 'pr.prod_id = i.inve_prod_id') // Asegúrate de unir correctamente
        ->get()
        ->getResultArray();
---
SELECT *
FROM `prestamo` `p`
JOIN `inventario` `i` ON `i`.`inve_id` = `p`.`pres_inve_id`
JOIN `usuario` `u` ON `u`.`usua_id` = `p`.`pres_usua_id`
JOIN `producto` `pr` ON `pr`.`prod_id` = `i`.`inve_prod_id`